def calculator(function):
    symbol = '+-/*'
    if not any(sign in function for sign in symbol):
        raise ValueError(f'Некорректно выражение, нет допустимых знаков ({symbol})')
    for sign in symbol:
        if sign in function:
            try:
                left, right = function.split(sign)
                left, right = int(left), int(right)
                return {
                    '+': lambda a, b: a + b,
                    '*': lambda a, b: a * b,
                    '/': lambda a, b: a / b,
                    '-': lambda a, b: a - b,
                }[sign](left, right)
            except (ValueError, TypeError):
                raise ValueError('Выражение должно содержать целые числа и один знак')
            except(ZeroDivisionError):
                raise ZeroDivisionError('На ноль не делят')


if __name__ == '__main__':
    print(calculator('10 + 2'))


#Иногда полезно быстро изменить регистр слов с
# верхнего на нижний, или наоборот, в этом нам
# поможет сочетание клавиш
#
# Ctrl + Shift + U.


#Скопированный код с сайта чаще всего
# требует форматирования, особенно это касается отступов,
# вручную это делать долго и нудно, поэтому существует команда
#
# Ctrl + Alt + L,
# она в миг исправит все ошибки форматирования в коде и расставит все по своим местам.


#Очень полезное и всеми любимое сочетание клавиш быстрого закомментирования
# текста, выручает, когда закомментировать часть кода чтобы избежать его выполнения
#
# Ctrl + /.


#Некоторые конструкции, например такие как if, elif, else требуют
# обозначения вложенности (отступов), т.е. после условия нужно отступить
# от левого края нажав кнопку пробел на четыре раза. Такой ввод можно заменить,
# нажав один раз кнопку Tab. Обратная команда Shit + Tab, убирает отступ.



#Быстро продублировать строку поможет сочетание клавиш
#
# Ctrl + D.


#Для быстрого перемещения строк или блоков используйте сочетание клавиш
# Ctrl + Shift + Стрелка вверх –
#
# двигает выделенный блок или строку вверх,
# Ctrl + Shift + Стрелка вниз
#
# – двигает выделенный блок или строку вниз.


#При помощи сочетания клавиш Ctrl + W, можно выделить текущий блок,
# если нажимать это сочетание дальше, то будут выделяться родительские блоки.

#Если зажать Ctrl и кликнуть например
# на переменную, то мы попадем в блок кода где эта переменная определена.


#Показ последних блоков кода с которыми работали
#Весьма пригодная команда, для вызова ее используйте комбинацию клавиш
#
# Ctrl + Shift + E.


#Установка и управление закладками
#Для того чтобы установить закладку на строке кода,
# используйте сочетание клавиш Ctrl + F11, откроется
# меню в котором можно будет выбрать в качестве имени
# закладки как цифру, так и букву. Быстро установить
# безымянную закладку поможет клавиша F11, открыть меню
# с закладками можно при помощи сочетания клавиш Alt + 2.






